In [1]:
%load_ext autoreload
%autoreload 2

In [47]:
from kaggle_competitions.titanic.run import load_train_data, load_test_data
from pathlib import Path

df_train = load_train_data(basedir=Path("."))
df_test = load_test_data(basedir=Path("."))
df_train.head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [48]:
df_test.head(1)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [68]:
from kaggle_competitions.titanic.run import data_preprocess, run

data_preprocess(df_train)

             Survived  Pclass     Sex        Age Cabin Embarked
PassengerId
1                   0       3    male  22.000000     u        S
2                   1       1  female  38.000000     C        C
3                   1       3  female  26.000000     u        S
4                   1       1  female  35.000000     C        S
5                   0       3    male  35.000000     u        S
...               ...     ...     ...        ...   ...      ...
887                 0       2    male  27.000000     u        S
888                 1       1  female  19.000000     B        S
889                 0       3  female  29.699118     u        S
890                 1       1    male  26.000000     C        C
891                 0       3    male  32.000000     u        Q

[891 rows x 6 columns]

In [63]:
run()